# SubEntityWriteAccessGranted Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Field..::..SubEntityWriteAccessGranted Method
Field Class See Also
---
Checks whether there is write access to subentities storable in this field.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool SubEntityWriteAccessGranted()
```

Visual Basic
---
```text
Public Function SubEntityWriteAccessGranted As Boolean
```

Visual C++
---
```text
public:
bool SubEntityWriteAccessGranted()
```

# ### Return Value
True if subentities are writable.
# See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace